Table of Contents
 Class IdeaRegion3D
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaRegion3D : AbstractIdeaObject<IIdeaRegion3D>, IEquatable<AbstractIdeaObject<IIdeaRegion3D>>, IIdeaRegion3D, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaRegion3D>
IdeaRegion3D
Implements
IEquatable<AbstractIdeaObject<IIdeaRegion3D>>
IIdeaRegion3D
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaRegion3D>.Id
 AbstractIdeaObject<IIdeaRegion3D>.Name
 AbstractIdeaObject<IIdeaRegion3D>.Identifier
 AbstractIdeaObject<IIdeaRegion3D>.GetHashCode()
 AbstractIdeaObject<IIdeaRegion3D>.Equals(object)
 AbstractIdeaObject<IIdeaRegion3D>.Equals(AbstractIdeaObject<IIdeaRegion3D>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaRegion3D(Identifier<IIdeaRegion3D>)
public IdeaRegion3D(Identifier<IIdeaRegion3D> identifer)
Parameters
identifer Identifier<IIdeaRegion3D>
 IdeaRegion3D(int)
public IdeaRegion3D(int id)
Parameters
id int
 IdeaRegion3D(string)
public IdeaRegion3D(string id)
Parameters
id string
Properties
 LocalCoordinateSystem
Local Coordinate System (LCS) of the region 3D.
public virtual CoordSystem LocalCoordinateSystem { get; set; }
Property Value
CoordSystem
 Openings
Gets the hole polygons inside the region
public virtual List<IIdeaPolyLine3D> Openings { get; set; }
Property Value
List<IIdeaPolyLine3D>
 Outline
Gets the outline polyline of the region
public virtual IIdeaPolyLine3D Outline { get; set; }
Property Value
IIdeaPolyLine3D
 Edit this page